{
    "Page 1": "BAY AREA MEN’S SENIOR BASEBALL LEAGUE  \nRules & Regulations (Last Updated January 2024) \n \nFairness Doctrine \nAuthority for the BAMSBL Board and/or BAMSBL Commissioner \n \n100. Membership \n \n   105. Age Minimum – 18+, 35+, and 50+ Divisions \n   110. Team Fees and Payments to the League \n   115. Applicant Eligibility \n   120. Free Agent Eligibility \n   125. Draft Eligibility \n   130. Player Eligibility \n   140. Pool Players \n   145. Trades \n   150. Trading Deadline \n   155. Veterans choose not to return to current team \n   160. Dissolution of Teams \n   165. Anti-merger Rule \n   170. Anti-raiding Rule \n   175. Anti-collusion Rule \n   180. Anti-tampering Rule \n   185. Manager Responsibilities Rule \n \n200. Tryouts and the Draft \n \n   205. Spring Tryouts \n   210. Failure to Extend Best Effort \n   215. The Draft \n \n300. Equipment and Uniforms \n \n   305. Uniforms \n   310. Cleats/Spikes \n   315. Helmets \n   320. Bats \n   325. Baseballs \n   330. Pitcher’s Uniform \n   335. Failure to Adhere \n \n \n \n \n \n \n \n \n",
    "Page 2": "400. Game Requirements \n \n   401. Field Dugout Designation \n   405. Length of Game \n   410. Start of Game \n   415. Forfeit Rule \n   420. Batting Line-Ups \n   425. Fielding Line-Ups \n   430. Courtesy Runners \n   435. Injured Base Runner \n   440. Catcher 2-Out Base Runner \n   445. Two (2) Minute Rule \n   455. Last Weekend, Regular Season (Elimination Game) \n   465. Failure to Adhere \n   470. Protesting Games \n \n500. Conduct and Safety \n \n   505. Collision Rule \n   510. Decoy Rule \n   520. Intentional Walks & Hit Batsman \n   525. Abuse of Umpires \n   530. Un-Sportsmanlike Conduct \n   532. Fan/Spectator Un-Sportsmanlike Conduct  \n   535. Player Suspension \n   540. Suspension Appeal \n   545. Alcohol & Cannabis \n   550. Smoking \n   555. Pets \n \n600. Playoffs and Tiebreakers \n \n   601. Playoffs Eligibility Requirements \n   603. Playoff Rosters \n   605. Tie-Breaker Formula \n   610. Home Team Designation \n   615. Player Participation \n   620. Playoff Game Limits \n \n \n \n \n \n \n \n \n \n \n",
    "Page 3": "Bay Area Men’s Senior Baseball League  \nRules & Regulations \n \nFairness Doctrine \nThe Board and President of the BAMSBL shall have the authority to \noversee all player, team, and coach transactions. The Board has a \nduty to ensure that fair competition will prevail for the player(s), \nteam(s) and the League as a whole. \n \nAppeal of any sanctions, suspensions or terminations as set forth by \nthe BAMSBL Board and/or President. \n \nAs set forth in the Bylaws, any party disciplined, sanctioned, \nsuspended or had its’ membership terminated shall have the right to \nan appeal. Said party may submit a written statement to the BAMSBL \nBoard not less than five days before its effective date, showing \ncause as to why said disciplinary action should be overturned, \nlessened, or modified. The President of the BAMSBL will rule on the \nappeal. Said President, at his choosing, may elect to defer his \ndecision to a vote by the BASMBL Board, or form a grievance committee \nto make a recommendation as to the disposition of the appeal. \n \nAuthority for the BAMSBL Board and/or BAMSBL President \nAs set forth in the Bylaws of the Bay Area Men's Senior Baseball \nLeague, which are registered and on file as the By Laws of Bay Area \nMen's Senior Baseball League, Inc. with the State of California, the \nPresident and/or the Board shall have and exercise the authority to \ndiscipline any League members for any conduct or actions deemed \n\"inimical to the best interests of the corporation\". This shall \ninclude any actions, intentional or otherwise, to violate, circumvent \nor evade any League rules, reasonable intent of the League rules, \nproven intent of the League rules, historical League practices or \nLeague precedents. This shall also include direct or indirect \nviolations of Board or President Directives. Said disciplinary \nmeasures may include but are not limited to suspension of League \nmembership, termination of League membership or any League sanctions \nset forth as determined by the BAMSBL Board to apply to the specific \ncase. The Board shall notify any affected member(s) of any \ndisciplinary actions at least 15 days prior to the effective date \nsaid disciplinary actions are to take place. \n \n \n \n \n \n \n100.  Membership \n \n",
    "Page 4": "105. Age Minimum 18+, 35+, and 50+ Divisions \n    A. Players who turn 18, 35, or 50 prior to 11:59 p.m. on December \n31 are eligible to play in the BAMSBL. Any player that turns 18, 35, \nor 50 during the calendar year is eligible to play the entire season. \n    B. Any game(s) played with player(s) underage shall be deemed \nimmediately forfeited by that team. The player(s) involved will also \nbe ineligible for the duration of the current season, regardless of \nwhen the player(s) officially turns 18, 35, or 50 years old. \n    C. \nA \nmanager \nhas \nthe \nright \nto \ndemand \nto \ninspect \nthe \nidentification of any player on the field, before, during or after an \nofficial \nBAMSBL \ngame. \nUntil \nthe \nplayer \nproduces \nacceptable \nidentification, said player in question will not be allowed to \nparticipate \nin \nsaid \ngame \nor \nany \nfuture \ngames. \nAcceptable \nidentification is defined as: a valid driver’s license, valid \npassport, valid Federal or State Government ID card or any \nidentification which the umpire accepts as valid identification. \n    D. Should the requesting manager still not be satisfied or agree \nwith the authenticity of the identification presented, the said \nmanager will immediately (within 24 hours) file a protest to the \nLeague Office for review. A protest may be called and followed up in \nwriting explaining why the manager feels that the ID presented is \nstill in question. President will then investigate and report \nfindings to the Board for review, decision, and any sanctions, if \nwarranted. \nE. If any sanctions are applied, the normal appeal process will \napply. \nF.  The League President reserves the right to grant age waivers on a \ncase-by-case basis, when presented with a compelling reason to do so.  \n \n \n110. Team Fees and Payment to the League (adopted January 2012) \nOne-third (1/3)  due 2/15 \n$1,667 (example amount only) \nTwo-thirds (2/3) due 3/15 \n$3,333 \nFull Payment     due 4/15   \n$5,000 \n \nA. Full Balance must be paid by June 30th with agreement by Treasurer or \nBoard by April 15th. \n \nB. If payment is not made in full by June 30th, or a specific agreement \nwith the Treasurer or Board is not made by the June 30th deadline, \nthen effective immediately the team will not be allowed to play. \n  \nC. Once the payment or an agreement is made, a team will be allowed to \nplay on the league’s field. \n \nD. Any team which does not keep an agreement with the League to pay will \nnot be allowed to play.  \n \n \n",
    "Page 5": "115. Applicant Eligibility \nAn applicant is eligible to participate in league-sanctioned tryouts \nif they have met the following requirements: \n \n    A. Will turn 18 years of age during the calendar year and has \nmeans to verify it. \n \n    B. Has completed the necessary league registration form(s). \n \n    C. Is available to play on any team that exists in the region and \nage bracket for which they qualify. \n \n120. Free Agent Eligibility \n    A. Unlimited in number, however no BAMSBL members from the \nprevious year are eligible. \n \n    B. Has completed the required registration/waiver form(s). \n \n    C. Has provided the team manager with a registration form. \n \n \nD. Has been put on the team roster for other team managers to \nverify the player’s eligibility. \n \n    Any team that has not verified the player has signed the required \nwaiver form(s) and posted the player on their public roster before \nsaid player takes the field will forfeit their exclusive rights to \nthat Free Agent. If the Free Agent still desires to play, they will \nbe subjected to normal draft rules. \n \n    E. The presiding league Board of Directors must approve any \nexceptions \nor \ndeviations \nfrom \nthe \nFree \nAgent \nEligibility \nrequirements. \n \n \n125. Draft Eligibility \n    A player is eligible for the BAMSBL draft pool if they have met \nthe following criteria: \n \n    A. Has attended and participated in one sanctioned Spring Workout \nfor each division the candidate desires to play in (this can be \nwaived by consent of all managers respective to their division) and \nfollowed the tryout program given by the Spring Workout Division \nRepresentative. \n \n    B. Has presented a valid photo ID indicating at least 18, 35, or \n50 years of age by the end of the year. \n \n    C. Has completed registration/waiver form. \n",
    "Page 6": " \n130. Player Eligibility \n    A player is eligible to participate in league play if they have \nmet the following requirements: \n \n    A. Has paid in full the current Team membership fee. \n \n    B. Has been properly drafted, traded, or selected as a free agent \naccording to league rules & guidelines. \n \n    C. Has returned as a veteran player or was an eligible player on \nsame team the previous year. \n \n    D. Is properly attired. \n \n    E. Is not currently serving a league suspension or game ejection. \n \n    F. Is a BAMSBL member in good standing as defined by the BAMSBL \nArticles of Incorporation. \n \n \n140. Pool Players \nFrom time to time we hear from players who have heard about our \nleague, but never played in the BAMSBL.  Sometimes they will contact \nleague presidents or the commissioner about playing in our league \nafter the season has started.  Also, some of these players may have \nbeen in the Tryouts and not Drafted.  League presidents will put all \nof them into a “Players Pool” for future consideration by team \nrepresentatives.  A Pool Player may be added to a team in order to \nadjust the roster so as not to forfeit a lack of players. \n \nA. \nLeague President will keep a list of Pool   Players as the \nseason progresses. \n \nB. \nLeague President will offer Pool Players to all team \nrepresentatives. Representatives may also ask to see the Pool \nPlayers list. \n \nC. \nThe league president will control who is called and when, to \nfollow up and see if the player actually gets on a team. \n \n \n \n",
    "Page 7": "145. Trades \nThe BAMSBL sanctions the following types of trades: \n \nA. Interdivisional – Between teams within own division \n \n       1. Player for player \n       2. Player for current draft pick(s) \n       3. Current draft pick for current draft pick \n       4. Trading for future draft picks is not allowed \n \nNo outside compensation will be allowed for consummating a trade. \nExample: A player cannot be traded for baseball equipment or \nother fungible goods. \n \n    B. Trades between age groups (Leagues) \n \nIf players are traded between different Division teams, said \nplayers would be eligible only if the requisite minimum number of \ngames is met by the players with their respective new teams, and \nthey meet 18+, 35+ or 50+ age requirements. The established \ntrading deadline will still apply. \n \n    C. All trades must be approved by: \n \n       1. All involved parties \n       2. Both managers \n       3. League President \n \n150. Trading Deadline \nThe trade deadline is after the completion of the eighth (8th) \nscheduled game. No trades can be made after this time. \n \n \n \n",
    "Page 8": "155. Veterans Choosing Not to Return to Same Team \nVeterans who choose not to return to their current team at the \nend of each season, a player may choose not to return to their \ncurrent team. The player has three (3) options: \n \n    A. Re-enter the draft. Players must notify team manager and \nattend 1 sanctioned spring tryout. \n \n    B. Request a trade (see rule #145). Request must be made through \nthe current team manager. \n \n    C. If a player sits out a full season, they have the option to \nbecome a free agent. A current player is not eligible to join another \nteam via free agency. Once a current player has stepped on the tryout \nfield, they are no longer eligible to return to their former team, \nunless they choose to draft him. If another team drafts him, no \ncompensation is due to the former team. \n \n \n160. Dissolution of Teams \nTeams shall be declared dissolved only after the following steps have \nbeen taken, Coach or voted representative of affected BAMSBL team \ninforms their BAMSBL League President, BAMSBL League Representative \nor BAMSBL President that said team has no one on roster willing to \ntake over the responsibilities of a coach for the upcoming season. \nSaid affected League Representative shall try and explore all options \navailable to find a coach for the affected team. If no coach can be \nfound, then said Board may declare the team as a dissolved team. \nCoach of dissolving team is prohibited from coaching another team for \nthat year without the express approval of said Board. If such actions \ncan be proved or has the reasonable appearance of a violation of the \nabove procedures or rules as determined by said Board, than teams, \ncoaches and the player(s) involved may be subject to disciplinary \nmeasures including (but not limited to) censure and/or suspension. \n \n \n165. Anti-Merger Rule [Adopted March 2001] \nNo teams may be allowed to merge with other teams without the express \napproval of the BAMSBL Board. Said Board must approve of such a \nmerger via simple majority vote. \n \n170. Anti-Raiding Rule [Adopted March 2001] \nTeams and/or their coaches of the BAMSBL are prohibited from \nconspiring, \ncolluding, \nor \nattempting \n(intentionally \nor \nunintentionally), to raid other team rosters, or cause teams \n(including their own) to dissolve for the purpose of forming new \nteams. \n \n",
    "Page 9": " \n175. Anti-Collusion Rule [Adopted March 2001] \nTeams and/or their coaches of the BAMSBL are prohibited from \nconspiring, \ncolluding, \nor \nattempting \n(intentionally \nor \nunintentionally) \nto \ncircumvent \nrules \n(written \nor \nunwritten), \npractices \n(written \nor \nunwritten) \nor \nprecedents \n(written \nor \nunwritten). The BAMSBL Board and the President shall have sole \ndiscretion of determining if the teams or coaches of said teams have \nviolated any of the either in the present or future. \nIf such actions can be proved or has the reasonable appearance of a \nviolation of the above as determined by said Board, then teams, \ncoaches and any player(s) involved may be subject to disciplinary \nmeasures including (but not limited to) censure and/or suspension. \n \n180. Anti-Tampering Rule [Adopted March 2001] \nBAMSBL teams and/or their coaches are prohibited from conspiring, \ncolluding, or attempting (intentionally or unintentionally), to raid \nother BAMSBL team rosters for the purpose of filling their own roster \nor another team’s roster. \n \nThis includes (but is not limited to) suggesting or encouraging \n(intentionally or otherwise) players to quit their teams for the \npurpose of going into the draft so that they may be selected by a \nteam or its coach encouraged said player move. If such tampering can \nbe proved or has the reasonable appearance of tampering as determined \nby said Board, then teams, coaches and the player(s) involved may be \nsubject to disciplinary measures including (but not limited to) \ncensure and/or suspension. \n \n \n185: Manager Responsibility Rule (adopted Jan. 2024) \n \n \n \n1.  A team manager must perform his managerial duties with the \nutmost conduct that is supportive to the welfare, interest, \nreputation, and charter of the BAMSBL. Including: proper on-field \nconduct with umpires, teammates, opponents, and guests in attendance. \n \n \nA. The League board may discipline a manager who fails to \nadequately maintain a current phone and email address; repeated \nfailure \nto \nrespond \nand \nparticipate \nin \nrequested \nleague \ncommunications; history of tardiness when reporting scores and \nstatistics; misappropriation of team fees; history of delay when \npaying team fees to the league and any other action or behavior that \nis detrimental to the league.    \n \n \n \n2.  Each team is required to report the final score of their \ngame by 6 pm, or at the conclusion of that day's game if played late \nin the day. Each team is also required to submit complete game \nstatistics (batting and pitching) to the league website by 9 pm the \nfollowing Tuesday.",
    "Page 10": " \n185 (continued): Manager Responsibility Rule (adopted Jan. 2024) \n \n3.  If a team has not posted its statistics within 10 days of a \ncompleted game, the team will lose 1 point in the standings for the \nfirst offense.  For the second offense in a season (or an additional \n10 days from the first offense), the team will lose 2 points in the \nstandings. For the third offense in a season (or an additional 10 \ndays from the second offense), the team will not be eligible for \npostseason play. \n \n     A. Managers are responsible for team statistics being \nentered on the website regardless of where their team stands in the \ndivisional standings.    \n \n 4. The League board may remove a manager from his managerial \nduties for conduct that is determined to be prejudicial and not in \nthe best interest of the league.   \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n",
    "Page 11": "200.  Tryouts and The Draft \n \n \n205. Spring Tryouts \nOne of the primary goals of BAMSBL, Inc. is to provide an opportunity \nfor interested individuals to play amateur baseball. We make this \nopportunity available through annual spring tryouts. Whether by \nleague expansion, replacement of retired/non-returning players, or \nother means, the league attempts to leave no applicants behind. \nManagers or coaches will represent teams in need of new players, and \nthey will observe and evaluate the skill level, hustle, and attitude \nof each applicant at the tryout. The spring tryouts are usually held \nbeginning in mid-February, over the course of up to 2-3 weekends, \nweather permitting, in the below listed areas: \n \n    * San Francisco \n    * East Bay \n    * Peninsula \n    * Marin \n \nAll eligible applicants must put forth their reasonable best efforts \nduring the official spring tryout. The eligible applicant must also \ndeclare and perform all components of the positions they plan on \nplaying during the season. They include: \n \n    * Batting \n    * Fielding (infield & out) \n    * Running \n    * Pitching \n    * Catching \n \nIf a pitcher or catcher fails to declare & perform for the \nmanagers/coaches, they will NOT be permitted to pitch or catch during \nthe regular season or playoffs. \n \n210. Failure to Extend Best Efforts \nA. All eligible applicants are required to put forth all reasonable \nbest efforts during the sanctioned spring tryout. If an applicant is \njudged by at least 3 managers/coaches to have not expended, in their \nview, a best effort, then that applicant will not be eligible for the \ndraft. \n \n",
    "Page 12": "B. If during the season (regular or post), it becomes apparent to at \nleast 3 managers in the player’s division that they did not expend \nreasonable best efforts during the spring tryout, said player may be \nsubjected to suspension or expulsion, and the player’s team may \nsuffer forfeiture of any games in which the player participated. \n \n215. The Draft \n    A. All managers within their respective divisions meet to select \neligible applicants. \n \n    B. At the draft meeting, each team, to fill its roster \nrequirements, selects a pre-determined number of applicants in a pre-\ndetermined order. Usually, the order is determined by the final \nstandings from the previous regular season. In reverse order of \nfinish, the teams select an applicant round-by-round, until all \nrosters are full, or all applicants have been exhausted. \n     \n    C. The presiding league Board of Directors must approve any \nexceptions or deviations from the draft requirements. \n \n    D. Forfeits & Won – Loss records – For the purpose of determining \ndraft positions between teams with identical won-loss records, a team \ncannot count as a loss any forfeits they incur the previous season. \nAny team in this situation will have the drafting position \nimmediately after the team it was tied with. \n \n    E. Tiebreaker Rule: If the total wins of two or more teams are \nthe same, the tiebreakers will be: \n \n        1. Head-to-Head Competition \n        2. Division Record \n        3. Inter-Division Record \n        4. Difficulty of Schedule \n \n \n300.  Equipment and Uniforms \n \n305. Uniforms (revised 2023) \nAll teams participating in BAMSBL sanctioned games must meet league \nuniform requirements. Every player must have a number on the jersey, \nmatching caps, pants & jerseys in presentable condition for each \nregular season and playoff game. Each team has until the 4th league \ngame to get all their players (drafted or traded) properly attired. \n \n310. Cleats/Spikes \nPlayers may wear metal, plastic or rubber baseball or softball \ncleats/spikes. Rubber sole shoes, or rubber baseball cleats are \n",
    "Page 13": "required on synthetic turf fields. Metal cleats cannot be worn on \nsynthetic turf unless otherwise specified. \n \n \n \n315. Helmets (Revised Jan. 2015) \n \n    A. All batters must wear a helmet with at least one (1) earflap \n(facing the pitcher) when batting. If a player wishes to wear \na non-flap shell helmet, he must sign the required league \nwaiver prior to any league participation. \n \n    B. All base runners must wear a helmet. Earflaps are optional. \n \nC. Catchers must wear either a catcher’s helmet or protective \nskullcap when catching. If a catcher wishes not to wear a \nhelmet, he must sign the required league waiver prior to any \nleague participation. \n \nD. All base coaches must wear a protective helmet or skullcap.  \n \n \n320. Wood Bats (Adopted October 2014) \nWe are a wood bat League.  Only wood bats may be used during league \nplay. Approved graphite, or composite bats may also be used during \nleague play. \n \n325. Baseballs \n    A. Only league-approved baseballs may be used during league play. \nThese baseballs are designated “game” balls and handed out to \nmanagers by the league prior to the start of the season. \n \n    B. Each team is required to supply 4 balls per game. The umpires \nwill return unused balls. \n \n    C. If the supply of balls becomes exhausted during play, either \nmanagers or presiding umpires may use a previously used approved ball \nupon consent. \n \n330. Pitcher’s Uniform \nPitchers cannot wear white or gray sleeves, batting gloves, sweat \nbands, jewelry or other distracting items while on the mound. \n \n335. Failure to Adhere \nFailure to adhere to the requirements listed in this section could \nlead to player and/or manager ejection and/or suspension, and/or team \nforfeiture of games in which infractions occur. \n \n",
    "Page 14": "400.  Game Requirements \n \n401.  Field Dugout Designation (Adopted January 2018) \nThe Home team on the official schedule shall occupy the 3rd base \ndugout at all games. \n \nA. The Visiting team shall occupy the 1st base dugout.    \n \n405. Length of Game \n    A. Nine (9) innings or 3 hours. No new inning is allowed to start \nafter 3 hours. \n    B. Mercy Rule: There is no mercy rule. All games shall be played \nuntil completion or the end of 3 hours. \n \n410. Start of Game \n    A. Game time begins with the scheduled time. If a game is \nsupposed to start at 10 a.m. but does not begin on time due to \nreasons other than field conditions, weather conditions (or other act \nof God), or late umpires, then the 3-hour time limit starts at 10 \na.m. regardless of when the game starts. \n \n    B. Each team must have a minimum of 8 eligible players present, \nin full uniform and ready to play, no less than 15 minutes after the \nscheduled starting time, or a forfeit will be declared. In the \nbatting lineup, when batting position #9 comes up, an automatic out \nwill be recorded. The #1 batter will bat. If a legal player arrives \nto the game, they will be inserted into the #9 slot, and it will no \nlonger be recorded as an automatic out. \n \n    C. A team may reduce its lineup to seven (7) (offense & defense) \nonly because of injury incurred during the course of a game. The \ninjured player & manager must report such injury to the Home Plate \nUmpire before leaving the playing field. The umpire shall determine \nif the injury is legitimate and warrants leaving the game. In the \nevent of such an occurrence, the batting order remains the same, but \nan OUT is recorded each time the injured player is due to bat. \n \n415. Forfeit Rule (adopted January 2007) \nThe purpose of the Forfeit Rule is to limit the number of forfeits a \nteam can have in a season.  The impact of forfeits on the league has \na negative fiscal impact on the League accounts.  The League loses \nmoney to umpires and fields when a team forfeits on game day.  \nOpposing players play fewer games despite having paid the same league \nfees.  Finally, excessive forfeits reflect poorly on the League as a \nwhole.   \n \nThe Forfeit Rule will apply as follows: \n \n",
    "Page 15": "A. The Board will give serious consideration to expelling a team \nfrom the league who forfeits more than two games in a season.  \nThis will be done at the end of a season in which said team \ncommitted the forfeits, or prior to the start of the next \nseason. \n \nB. Teams that forfeit on game day more than once during the course \nof a season will need Board approval to rejoin the league the \nfollowing season (i.e. the team’s manager will have to make a \ncase before the Board as to why his team should be allowed to \nreturn). \n \nC. Any team that forfeits more than once, and allowed to return to \nthe League will be required to post a refundable deposit of \n$300.  This deposit will be used to pay for umpires and the \nfield in the event said team forfeits a game during the \nsubsequent season. \n \nD. If a team does forfeit their deposit because of a forfeit, they \nwill be required to post another $300 deposit before the next \nweek or game they play, if they intend to continue team play for \nthe rest of the season.  The deposit will be held over to the \nnext season if the team returns.   \n \nE. If a team does not forfeit during the subsequent season, the \ndeposit will be returned to the team manager at the end of the \nseason. \n \nF. A team that forfeits before 5:00 PM on the Thursday prior to a \nSunday game (Wednesday prior to a Saturday game) will not have \nto give up their deposit.   A team that forfeits more than once \non Wednesday or Thursday will need to explain their actions to \nthe Board and make a case for not being required to post a \nforfeit deposit or give up the deposit already paid to the \nleague. \n \nG. The players on a team that forfeits during the season will not \nreceive credit towards Playoff Participation (see rule #601) in \nthe same season.  The entire roster of players on the opposing \nteam who have been declared the winner due to forfeit will be \nconsidered game eligible toward Playoff Participation in the \nsame season.  \n \n420. Batting Line-up (Revised 2023) \n    A. Batting and fielding line-ups operate independently of each \nother. Each team may bat as many as it chooses provided there is a \nminimum of eight (8), but if nine (9) or more players are present for \na game then a minimum of nine (9) players must always be in the line-\n",
    "Page 16": "up. If only eight (8) players are in the lineup, then each time the \n9th spot comes around in the lineup it shall be an automatic out. \nProfessional Baseball rules governing \"Batting out of order & Illegal \nSubstitution\" still apply. \n \n    B. Managers shall, prior to each game, supply the opposing \nmanager with a batting order that includes batters that will be \nprovided with courtesy runners. Player’s jersey numbers should be \nincluded (See rule #430) \n \n    C. Any batting change must be announced to the opposing manager, \ncoach/assistant or official scorekeeper prior to the change being \nmade. Umpires need not be notified. The batting line-up may only be \nchanged in the following manners: \n       1. PINCH HITTER – A player, who has yet to have been placed in \nthe batting line-up, bats in the line-up in place of a batter who is \nalready in the hitting line-up and has met the batting participation \nrequirements. \n       2. ADDITIONAL HITTERS – A team may bat more than 9 players in \ntheir lineup. At any time during the game, lineups with over 9 \nbatters may drop players from any position in the lineup if there are \na minimum of 9 batters. A player who has not yet been placed in the \nbatting line-up and is not pinch hitting for another player, may be \nadded to the line-up, but only at the end of the batting order. \n       3. REMOVED HITTER – A player may be removed from the batting \nline-up provided the line-up still contains the minimum number of \nhitters required (see #420A). Once a player has been removed from the \nhitting line-up, they may not bat again during the game.  Any removed \nbatters must be declared prior to the first pitch of your batted half \nof the inning. \n       4. A/B- ALTERNATING HITTERS – Managers may select an A/B \nhitting order for players. Using this system, 2 hitters are placed in \na batting slot, and when this spot appears, alternate batting turns. \nSame rules apply concerning adding, changing, or removing hitters \nfrom the batting order. \n       5. If a player is ejected from the game by the umpire, each \ntime his position in the lineup comes around it will be considered an \nautomatic out, unless a pinch hitter is available and inserted into \nthe game. (Adopted January 2023)    \n \n425. Fielding Line-up \n    A. Fielding and batting line-ups operate independently of each \nother. All substitutions made on defense are unrestricted, except for \nthe pitcher. Any player who departs or is removed from the position \nof pitcher may return to pitch only once, but not until, at the very \nearliest, the next new inning, following his initial departure from \nthe mound.",
    "Page 17": "430. Courtesy Runners \n    A. Teams with nine (9) batters are permitted two (2) courtesy \nrunners. Teams with eight (8) batters are permitted one (1) courtesy \nrunner. Prior to the start of each game, managers have the option to \ndesignate the batters who require \"courtesy substitute base runners\", \nafter reaching base. \n \n    B. Each respective \"courtesy base runner\" will be the player who \nhas made the last batted out. If no last batted out hitter is \navailable to run (1st inning), then the duty goes to the last batter \nlisted in the line-up. \n \n    C. A \"courtesy base runner\" must be inserted immediately, and \nbefore play resumes. If the \"courtesy base runner\" is not inserted \nimmediately, (by the next pitch), then the designated player loses \nhis \"courtesy base runner\" privilege until their next plate \nappearance. \n \n \n435. Injured Base Runner \nIf a player is deemed injured by the home plate umpire and is unable \nto fulfill their duties as a base runner, a \"courtesy base runner\" \n(last batted out) will be permitted. The injured player is then \npermanently removed for the duration of the game. \n \n440. Catcher 2-out base runner \nWhen 2 outs exist in any inning and the catcher is on base, a \n\"courtesy base runner\" must be immediately inserted (last batted \nout).  This rule only applies to the catcher.  This will allow each \nteam to adhere to the 2-minute rule. (See rule #445) \n \n445. Two (2) minute rule \nEach team has two (2) minutes from the recording of the last out in \nthe previous half inning to get ready for the next half inning. This \ntime includes pitcher, infielder & outfielder warm-ups. \n \n455. Last Weekend of Regular Season (Elimination Game) \nIn the event an elimination game is required the following will be \nadhered:  Games played in the last week (Week 16) of the “regular \nseason schedule” are guaranteed for all players who qualify by league \nrules.  It will be an elimination game, and not part of the regular \nplayoff series.  All rules for the regular season will apply.  \nPlayoff series do not begin until all teams in both leagues have \nplayed a “regular season schedule” (16 games), or a “regular season \nschedule” as determined by the Board. \n \n465. Failure to adhere \n",
    "Page 18": "Failure to adhere to the requirements in this section could lead to \nplayer and/or manager ejection, suspension and/or team forfeiture of \ngames in which the infractions occur. \n \n470. Protesting Games \nThe League shall adopt rules governing procedure for protesting a \ngame, when a manager claims that an umpire’s decision is in violation \nof these rules. Rules of the game when not posted in the BAMSBL \nHandbook will be the standards followed by Major League Baseball. No \nprotest shall ever be permitted on judgment decisions by the umpire. \nIn all protested games, the decision of the League President shall be \nfinal. However, a manager may appeal the decision of the League \nPresident to the League Board of Directors. \n \nWhenever a manager protests a game because of alleged misapplication \nof the rules the protest will not be recognized unless the umpires \nare notified at the time the play under protest occurs and before the \nnext pitch is made or a runner is retired. A protest arising on a \ngame-ending play may be filed until noon the following day with the \nLeague President. \nEven if it is held that the protested decision violated the rules, no \nreplay of the game will be ordered unless in the opinion of the \nLeague President the violation adversely affected the protesting \nteam’s chance of winning the game. \n \n \n500.  Conduct & Safety \n \n505.  Collision Rule (Revised January 2013) \nThis rule is not a “must slide” rule, but a “no collision” rule.  All \nrunners must either legally slide, legally avoid the tag, or give up \ntheir right to a base (avoid a collision by stopping/leaving the base \npath) if the defensive player has clear possession of the ball.  When \nadvancing to a base or the plate, the runner must avoid intentional \nforceful contact to jar the ball loose from the fielder, injure the \nfielder, or employ an “illegal slide” in the judgment of the \numpire.  An “illegal slide” is defined as, but not limited to, “roll \nblocks”, “high spikes” slides (general at or above fielder’s knee), \nor making deliberate contact beyond the baseline of the intended \nbase/plate. Runners attempting to “break up” a double play can do so \nwith a legal slide, but the runner must perform a legal slide within \nreach of the intended base/plate if coincidental contact with the \nfielder occurs.  Contact can range from very minor to directly \nimpacting and dangerous.  It is up to the umpire’s discretion of the \ndegree of deliberate and intentional contact warrants an automatic \nout, interference, an ejection, or if it is deemed a “clean” baseball \nplay. \n \n",
    "Page 19": "510. Decoy Rule (Revised January 2007/2022) \nA fielder may not use a decoy to force a player into a dangerous \nsituation.  For example, if a fielder fakes a tag, forcing a player \nto slide, when there is no strategic purpose or apparent play, the \nrunner will be ruled safe, and all runners will advance one base. \n \nThis is entirely an umpire judgment decision and not a rule that may \nbe protested. \n \n520.  Intentional Walks and Hit Batsmen (Revised Jan.2007/2018) \nA.  Each team is allowed to intentionally walk an opposing team \nplayer once in a game.  Therefore, the total number of intentional \nwalks each team is allowed each game is one (1). The umpire will send \nthe batter to first base when the opposing manager indicates he wants \nto walk the batter.   \n \n1. If a team attempts an intentional walk twice in a game, the home \nplate umpire must stop play and have the catcher resume his \ndefensive position behind the plate.  A balk will be called and \nany runners on base will advance one base.  The count will also \nbe restarted at 0-0. \n \nB.  If a pitcher hits four (4) batters in one game, the pitcher must \nbe removed. \n \n1. No pitcher shall intentionally throw at a batter in either the \nbatter’s box or in the batter’s on-deck circle. If, in the \njudgment of the presiding umpires, the pitcher intentionally \nthrows at the batter, said pitcher will be immediately ejected \nfrom the game and will be subject to further league action. \n \n525. Abuse of Umpires (Adopted January 2007) \nAny of the following actions can result in a player being ejected \nfrom a game, with possible suspension from additional games: \n \nA. Pushing an umpire or intentionally blocking an umpire’s movement \nB. Sustained arguing of an umpire’s decision. \nC. Using abusive, profane, threatening, or obscene language or \ngestures \nD. Throwing a bat, glove, helmet, or other equipment in anger \nE. Creating a disruptive, threatening, or dangerous situation \n530. Un-Sportsmanlike Conduct \nAnything not constituting Un-SPORTSMANLIKE CONDUCT will not be \ntolerated. Examples include, but not limited to: \n \n    A. Fake tags & deaking runners. \n    B. Throwing equipment in any careless, dangerous, or malicious \nmanner. \n",
    "Page 20": "    C. Swearing at anyone in attendance: Players, Umpires or \nFans/Spectators. \n    D. Taunting or any other displays of disrespect for person, \nproperty, or the game of baseball itself. \n    E. No player shall charge another player on or off the field.  \n    F. In the case of A & C, a warning shall be issued at the very \nleast. \n    G. In the case of B, D, & E offending player(s) shall be ejected \nwith the possibility of suspension upon umpire’s recommendation. \n \n532. Fan/Spectator Un-Sportsmanlike Conduct (adopted January 2012) \nAnything constituting UN-SPORTSMANLIKE CONDUCT will not be tolerated. \nExamples include, but not limited to: \n \n    A. Throwing projectiles (containers, food, equipment, etc.) in \nany careless, dangerous, or malicious manner onto the field or at the \nplayers. \n    C. Swearing at anyone in attendance: Players, Umpires, or other \nFans/Spectators. \n    D. Excessive Taunting of Players, Umpires, or any other displays \nof disrespect for person, property or the game of baseball itself. \n    E. No fan/spectator shall charge another fan/spectator or player \non the field, in the viewing stands, or parking lot.  \n    F. In the case of C & D, at the very least a warning shall be \nissued by the umpire and/or team manager if both agree to do so. \n    G. In the case of A, D, & E offending fan/spectator(s) shall be \nejected from the venue when the umpire and/or team manager agree to \ndo so. The possibility of not being allowed to attend future games \nupon recommendation of umpire, manager, and players. \n \nH. If after being requested to do so, a fan/spectator refuses to \nleave the stands, a team may decide not to take the field.  The game \nwill be delayed or postponed.    \n \n535. Player Suspension \n    A. A player who is ejected will receive an automatic suspension \nfrom the next official game. All-Star or tournament games will not be \nconsidered official games for purposes of serving out the suspension. \nOnly games that affect league records/standings or playoff games will \nbe used to serve out the suspension. Suspension may be carried over \nto next season if necessary (a player is ejected from final regular \nseason game and his team is not in the playoffs). \n    B. A suspended player will have his case reviewed by the League \nPresident, who may decide upon further review that additional \ndisciplinary action, is warranted.  \n \n \n1.  If the umpire deems the action by a player’s ejection \nwas “very serious,” said player may be suspended up to 3 games by the \nPresident or Board of Directors. (Adopted January 2019). \n",
    "Page 21": "    C. Manager of the offending player is required to submit a report \nwith 24 hours regarding the incident. The manager will face a \nsuspension of at least 1 game for not reporting an incident. \n \n540. Suspension Appeal \nThe suspended individual may appeal any disciplinary action taken by \nthe league. This appeal must be made in writing and submitted to the \nLeague President. Once notified, the League President has 48 hours to \nreview the appeal and render a decision. If the individual, upon \nreceiving this decision, still disagree, they may appeal the decision \nto the Board of Directors. A decision will be made within 24 hours of \nreceiving the appeal. The President and/or Board’s decision is final. \n \n545. Alcohol & Cannabis (revised February 2018) \nPossession or consumption of Alcoholic Beverages and Cannabis \nproducts is strictly forbidden at any high school, college, \nuniversity, or public park & recreation location used by the BAMSBL. \nFurthermore, it is AGAINST THE LAW! The only beverages other than \nwater permitted at any location are milk, juice, sport, or soft \ndrinks. Any offender of this policy will: \n \n    A. Be suspended for the baseball season. If offender(s) are \ncaught after the 14th league game, said offender(s) will be suspended \nthrough the next season. \n    B. Offender(s) subject to revocation of local and national MSBL \nmembership and possible criminal action. Teams that fail to comply \nand/or fail to properly identify any conspicuous offenses will also \nbe subject to: \n1. Forfeiture of game on date of the offense. \n2. Suspension of presiding manager. \n3. Team permanently banned from using field where offense occurred. \nThe BAMSBL is fortunate to be permitted the use of these \nfacilities. Our agreements require us to follow their rules, as \nwe are guests on their property. Failure to do so may cause them \nto cancel our agreements. \n \n550. Smoking \nSmoking cigarettes, cigars, electronic devices or any other substance \nis strictly forbidden on any playing field or dugout. \n \n555. Pets \nPets are forbidden on any playing area and dugout. Pets are permitted \nin the spectator area, but must be confined to a leash, with a \nresponsible person controlling the animal. Failure to comply with \nthis requirement may lead to suspension, revocation of league \nmembership, criminal citation and/or civil damage claim. \n \n600.  Playoffs and Tiebreakers \n",
    "Page 22": " \n \n601. Playoff Eligibility Requirements (Adopted in revised form Jan. \n2015) \n \n1. The player must participate in at least six (6) games. \n \n2. Participation is defined in the following ways: \nA. The player has had at least two (2) plate appearances in the \ngame for participation. \nB. The player has pitched and recorded a minimum of three (3) \nouts in the game. \nC. Proof of participation must be done by posting statistics on \nthe league official stats website.  If no statistics appear \non the website for all managers to view before the playoff \ngames begin, there shall be no player participation credited. \n \n3. Injury Exclusion and Waiver (adopted January 2019) \nA. No participation credit for games missed due to injuries on \nor off the field during the regular season shall be granted \nto a player towards eligibility in the postseason playoffs.  \n \n4. When a game is forfeited during the regular season, all players \non the winning team shall be deemed as having played in a game \nfor the purpose of player playoff game eligibility. \n \n603.  Playoff Rosters (Adopted January 2015) \n \n1. It is the responsibility of each manager to post a \"playoff \nroster\" of eligible players within 24 hours of the final regular \nseason game.  \n \n2. It is the responsibility of an opposing manager to review the \n\"playoff roster\" of their opponent to determine if the roster \nthey are reviewing is eligible. \n \nA. If the manager determines there is an ineligible player on \nthe roster, the opposing manager must report to the Board \nsaid player no later than Wednesday prior to the playoff \ngame. \n \nB. The Board will determine eligibility based upon Rule 601.  \nBoard determination of eligibility will be final. \n \n3. If no appeal to the Board is made as stated above, the right to \nappeal shall be declined by the Board.  There will be no \"game \nday\" appeal for eligibility. \n \n",
    "Page 23": "4. A team will forfeit their game if it is determined by the Board \nthat a player has played in a playoff game when ineligible to \nparticipate on the roster. \n \n \n605. Tiebreaker Formula \n \nThe following formula shall be used by the BAMSBL when determining \ntiebreakers for teams eligible for annual league playoffs: \n \nA. Head-to-head match-ups: record against team tied with. \nB. Final record against division teams. \nC. Run differential against team tied with. \nD. Runs allowed: Team giving up least amount of runs against \ndivision opponents. \nE. * Coin flip* \n1. The President will conduct the coin flip procedure. The \nPresident will attempt to have all concerned parties \npresent, either physically or by electronic means. This \nincludes but is not limited to Managers, Team \nRepresentatives or Board of Directors.   \n2. If one or both managers are not present, then a Board \nmember(s) will represent the teams. The President will flip \nthe coin. The results cannot be appealed. \n \n610. Home Team Designation (Revised January 2007) \n \nHome team designation will be granted to the team with the best \noverall won-lost record.  In the event of a three-game series, the \nhome team designation will alternate from game to game. \n \nA. In the event both teams have the same won-lost record, see \nrule #605 for tiebreaker. \n \n615. Playoff Player Participation (Adopted March 2007) \n \nParticipation Requirements in the actual Playoff Game do not apply. \nTherefore, players will NOT be required to have a plate appearance or \nan appearance in the field.   \n         \n620.  Playoff Game Limits (Adopted January 2015) \n \nThere will be NO time limit on playoff games.  However, the 10-Run \nMercy Rule will be in effect.  After 7 innings are completed, if a \nteam has a lead of 10 runs or more, the game will be ended by the \numpires and the team score leader will be declared the game winner.   \n"
}